[
  {
    "case_id": "case1",
    "role": "OTHER",
    "snippet": "Page 1\n[Court Seal: District Court, Kalutara, 26 JUN 2012]\nCase No.: D. 4221 In the District Court of Kalutara. Rajeeva Sampath Kumara Fernando\nResidence at: No. 58, Massala, Beruwala. Plaintiff\nVersus\nMalavige Shirani De Silva\nResidence at: No. 24, 1/1, Kaduwela Road, Battaramulla. Defendant\nOn this 19th day of February, 2004. The above-named Plaintiff, through his attorney-at-law Ranjith Punchihewa, presents his\namended plaint as follows:\n1. The above-named Plaintiff resides in the village of Beruwala, which is within the\njurisdiction of this court. 2. The Plaintiff and the Defendant were joined in the bond of matrimony on 25.01.2001 at\nthe Colombo Marriage Registrar's Office. The marriage certificate bearing number 858,\nwhich certifies the marriage, is marked ‘A’ and is presented as a p"
  },
  {
    "case_id": "case1",
    "role": "DECISION",
    "snippet": "The Plaintiff states that a wedding ceremony was held on 10.03.2001, and he brought the\nDefendant to the marital home. Page 10\n[Court Seal: District Court, Kalutara, 26 JUN 2012]\na) That the Plaintiff's case be dismissed;\nb) For a decree of divorce annulling the marriage between the Plaintiff and this Defendant on\nthe grounds of adultery committed by the Plaintiff and the Co-Defendant;\nAnd/Or,\nc) For a decree of divorce annulling the marriage between the Plaintiff and this Defendant on\nthe grounds of malicious desertion by the Plaintiff;\nd) That a sum of one million rupees (Rs. 1,000,000/-) be recovered from the Plaintiff as\npermanent alimony for this Defendant;\ne) That the legal and physical custody of the daughter born of the marriage in the caption,\nSara Kiyani Shenaya Fernando, be gran"
  },
  {
    "case_id": "case1",
    "role": "ARGUMENT",
    "snippet": "The Plaintiff states that the Defendant frequently created disputes and arguments with\nthe Plaintiff regarding his visiting and caring for those two children. The Plaintiff states that on or around 14.09.2002, when the Plaintiff informed the\nDefendant that he was going to visit his two children from his first marriage, she created\nan argument regarding it and told him not to come back to live with her and to go and live\nwith his first wife, scolding him in an insulting manner. Responding to paragraph 9 of the answer, this Plaintiff states that the Defendant created\narguments regarding his visiting the two children of his first marriage, and that on\n14.09.2002, the Defendant stated that she would not come to live with the Plaintiff, and\nthat when the Plaintiff went to work, the Defendant ha"
  },
  {
    "case_id": "case1",
    "role": "FACT",
    "snippet": "Based on the foregoing facts, a cause of action has arisen for the Plaintiff against the\nDefendant to obtain a decree of divorce annulling the bond of matrimony on the grounds\nof malicious desertion, as the Defendant maliciously deserted the Plaintiff on or around\n14.09.2002. This Defendant admits the facts relating to the marriage on 25.01.2001 mentioned in\nparagraph two of the said plaint. Without prejudice to the foregoing averments, | wish to emphasize the following facts:\n(a) That, in accordance with the Decree Nisi dated 03.06.2005, | have continuously paid\na sum of Rs. For an order to recover from the Plaintiff-Respondent the permanent alimony of one\nmillion fifty thousand rupees (Rs. 1,050,000/-) due to the Defendant-Petitioner as per the\nDecree Nisi entered in this case, the payme"
  },
  {
    "case_id": "case1",
    "role": "ISSUE",
    "snippet": "7,500/- per month for the maintenance of the\naforesaid daughter, Sara Kiyani Shenaya Fernando;\ng) That summons be issued on the above Co-Defendant together with this answer;\nh) That a sum of one million rupees (Rs. 1,000,000/-) be recovered from the Co-Defendant as\ndamages caused by the Co-Defendant to this Defendant;\ni) She states that after some time, problems arose between them, and despite her requests\nto resolve the issues and continue the marriage, the Plaintiff was unable to do so. She states she left the marital home on 14.09.2002 due to the issues."
  },
  {
    "case_id": "case2",
    "role": "OTHER",
    "snippet": "Page 1\n[Circular Stamp]\nEXPEDITIOUS SER...\n7-3-2025\n10-27...\nRs. 2500 Ex 2611\n151\nof the registrar of written\nRegistrar General's Department\nPower of Authoress and power of Attorneys. Diluka P. Vithanachchi\nAssistant Registrar General\nColombo District Office and Record Room\nSuhurupaya, Battaramulla\nD\n07/03/2025\nfor Registrar General\nDate. KVNN SENEVIRATNE,\nAttorney-at-Law & Notary Public,\nNo. 109A, Hulftsdrop Street, Colombo 12.\n0776084063 nadee.7843@gmailcom\nCode No: 01/01/01/1354\nJudicial Zone: Colombo\nDuplication: Colombo\nRegistrar General's Department\nDB 3318\nO07 MAR 2025 [Second Circular Stamp]\nEXPEDITIOUS SER\n17.3 2025\nRS 2500 Ex 2611\nSPECIAL FOREIGN POWER OF ATTORNEY\nTO ALL TO WHOM THESE PRESENTS SHALL COME I, LOKUKAMADI HENNADIGE RENUKA\nWIJETHILAKA nee RENUKA WIJEBANDARA (Holder of"
  },
  {
    "case_id": "case2",
    "role": "ISSUE",
    "snippet": "AND it is hereby expressly declared and agreed that as against me and any person claiming\nunder me or every act deed matter or thing which the said Attorney her substitute or\nsubstitutes shall execute or cause to be executed or done in relation to the premises\nsubsequent to the revocation of the powers expressed to hereby conferred or any of them\nshall be binding and conclusive in favor or every person claiming the benefit of such act deed\nmatter or thing who shall not prior to the execution or doing thereof have received express\nnotice of such revocation and it is hereby further declared that no such person shall be bound\nto inquire or as certain whether | am living or whether the said powers or any of them have or\nhas been revoked or otherwise determined. She states that the children bor"
  },
  {
    "case_id": "case2",
    "role": "ARGUMENT",
    "snippet": "The Defendant states that as she does not intend to lead a marital life with the Plaintiff, it\nis not necessary to participate in family counseling for this case, and that she is currently\nliving separately from the Plaintiff. Defendant\nThe proxy of the Defendant in the above-numbered case, along with the answer statement\nstating that the case is not being contested in accordance with Section 72 of the Civil\nProcedure Code, is hereby submitted. Court be informed of the settlement reached where the plaint is\nnot contested, and that this case be called in open court on the 21st day of April 2025 to make\nsubmissions for concluding the case proceedings without a contest. It has already been submitted and marked as P... The said evidence affidavit is submitted to the\nHon. Court that the\nDefenda"
  },
  {
    "case_id": "case2",
    "role": "FACT",
    "snippet": "Upon considering all the above facts, | am satisfied that a cause of action has accrued for the\nPlaintiff against the Defendant to have their marriage dissolved and to obtain a decree of\ndivorce on the marital fault of malicious desertion."
  },
  {
    "case_id": "case3",
    "role": "OTHER",
    "snippet": "Page 1\nIn the District Court of Colombo. Case Number: DDV/33/24\nNature: Divorce\nValue: Rs. 5000/-\nProcedure: Regular\nLoku Hapu Arachchige Nirmani Nadeeshika Buddadasa\nNo. 133, Shanthi Mawatha,\nMulleriyawa,\nAngoda. Plaintiff\n-Versus-\nHewage Tharindu Disan Rathnasiri\nNo. 297,\nAngampitiya,\nPadukka. Defendant\nOn this O3rd day of February, 2024. 1. lam the above-named Defendant in the above-numbered case, and | reside at the above\naddress. 2. | hereby state that | admit the cause of action mentioned in the plaint filed by the Plaintiff\nin this case and that | will not be filing a defense/answer. 3. 4. |, the Defendant, state that | have no objection whatsoever to a divorce judgment and\ndecree being granted in favor of the Plaintiff, in accordance with the relief prayed for in\nthe plaint's praye"
  },
  {
    "case_id": "case3",
    "role": "ARGUMENT",
    "snippet": "Submission made under Section 72 of the Civil Procedure Code. Furthermore, as both parties wish to conclude this case without a contest, | state that a\nreferral to a family counselor is unnecessary. Plaintiff\n-Versus-\nHewage Tharindu Disan Rathnasiri\nNo. 297,\nAngampitiya,\nPadukka.\nDefendant\nMotion\n| respectfully move that the proxy of the defendant and the submission made under Section\n72 of the Civil Procedure Code in the above-numbered case are submitted herewith, and |\npray that Your Honour may be pleased to order that they be accepted and filed in the case\nrecord. For these reasons, | state that | seek the relief prayed for in the prayer of this case and\nthat | do not wish in any way to be referred for family counseling. The Plaintiff states that since all attempts made by both parties"
  },
  {
    "case_id": "case3",
    "role": "FACT",
    "snippet": "The Plaintiff states that based on the foregoing facts and the aforesaid conduct of the\nDefendant, the marriage entered into based on the marriage certificate marked \"X-1\" has\nirretrievably broken down."
  },
  {
    "case_id": "case3",
    "role": "DECISION",
    "snippet": "Defendant\nWhen this case was called on the O6th day of March, 2024, before Her Honour Wandeema\nEdirimanne, the Additional District Judge of Colombo, for final disposal, whereas three (3)\nmonths had elapsed since the Decree Nisi was received by the defendant in open court, and\nwhereas the marriage entered into on the basis of marriage certificate No. 5975 dated\n2018/12/17 has been annulled and dissolved by the said Decree Nisi, and as no objections\nthereto have been filed, the said Decree Nisi is hereby made a Decree Absolute, and it is\nhereby ordered and decreed that it has been so made. It is hereby ordered and decreed as a Decree Nisi Further, it is hereby ordered and decreed that if there are any objections to this Decree Nisi,\nthey must be presented to the satisfaction of the court wit"
  },
  {
    "case_id": "case4",
    "role": "OTHER",
    "snippet": "Here is the full English translation of the provided court document:\nPage 1\nCase Number: 2022\nAddress: 210/8, €\n---0000---\nT\ngen\nThe above-named complainant, from his memory,\nstates as follows:\n1. The above-named complainant resides within the jurisdiction of this court. Therefore,\nthis honorable court has the jurisdiction to hear this case, and the complainant attests to\nthis fact. The complainant and the defendant were married on the 14th day of June in the year\n2000 at the Mahaweli Reach Hotel in Kandy. Following the marriage, the complainant and the defendant resided at the complainant's\nparents’ house in Gampaha, which they used as their matrimonial home. Thereafter, in the year 2001, they moved to a rented house in Wellampitiya, Colombo. At the time of the marriage, the complainant w"
  },
  {
    "case_id": "case4",
    "role": "ARGUMENT",
    "snippet": "A certified copy of the marriage certificate,\nbearing the number 800800 and dated June 14, 2000, is marked as 'P' and submitted to\nthe honorable court. Subsequently, during the trial, the plaintiff, Koralage Nalin Wasantha Fernando, gave evidence,\nand documents marked P1 to P4 were submitted on behalf of the plaint."
  },
  {
    "case_id": "case4",
    "role": "ISSUE",
    "snippet": "| respectfully submit the Plaintiff's proposed admissions and issues with this motion and\nrequest that they be accepted and filed in the case record. Plaintiff's Proposed Issues:\n1. If one, several, or all of the above issues are decided in favor of the plaintiff, is the\nplaintiff entitled to the reliefs prayed for in his plaint and replication? [Details of parties]\nTo the Honorable District Judge of Colombo\nThe defendant in the above-numbered case respectfully submits the following admissions\nand issues and prays that they be accepted and filed in the case record. Issues to be Determined:\n1. After the defendant appeared in court and filed her answer, a pre-trial conference was held,\nduring which the parties submitted the following issues to be determined. Issues to be Determined\n1. If one"
  },
  {
    "case_id": "case5",
    "role": "OTHER",
    "snippet": "Page 1\nPlaint\nIn the District Court of Colombo. Case Number: DDV 01015/24\nNature: Divorce\nProcedure: Regular\nValue: 50,000/-\nMaggona Gurunnanselage Lumini Maheshika Perera\nNo. 436/1/W,\nGodellawatta Road,\nMalabe. Plaintiff\nVersus\nNaekadage Don Amal Wageesha\nNo. 162/470,\nMadampitiya Road,\nModara,\nColombo 15. Defendant\nOn this ...... day of November, 2024. [Court Stamp: 05 NOV 2024]\nThe above-named Plaintiff, appearing through her Attorney-at-Law ............ , States as follows\nin her plaint:\n1. The Plaintiff states that this Honourable Court has jurisdiction to hear and determine this\ncase, as the Defendant in this case has established his permanent residence at the\nabove-mentioned address within the jurisdiction of this Honourable Court. [Stamp and Signature: True Copy, CHATHURYA DUNUWILA "
  },
  {
    "case_id": "case5",
    "role": "ARGUMENT",
    "snippet": "The Plaintiff states that although they led a very peaceful and good family life in the early\nstages after this marriage, with the passage of time and the increase of each other's\nofficial responsibilities, frequent arguments and disputes arose even without any\nparticular reason. Defendant\nMotion\nThe proxy of the defendant in the above-numbered case is submitted herewith, and |\nrespectfully pray for an order to accept it and file it in the case record. Defendant\nSubmission made under Section 72 of the Civil Procedure Code. Furthermore, as both parties wish to conclude this case without a contest, | state that a\nreferral to a family counselor is unnecessary. Accordingly, the terms of\nsettlement are submitted in writing. As | have prayed from the court at present, | have submitted certain re"
  },
  {
    "case_id": "case5",
    "role": "ISSUE",
    "snippet": "[Court Stamp: 05 NOV 2024]\nPage 3\n..and those issues escalated to the level of the marriage breaking down."
  },
  {
    "case_id": "case5",
    "role": "DECISION",
    "snippet": "For the purpose of obtaining a judgment and decree against the Defendant to the effect\nthat the Plaintiff and the two minor children born of the said marriage should be allowed to\nreside in the house belonging to the Defendant at No: 436/1/W, Godellawatta Road, Malabe,\nwhere the Plaintiff is currently residing, as their marital home, and/or alternatively, that the\nsaid Defendant's property should be sold and 50% of the said sale price should be given to\nthe Plaintiff;\na cause of action has accrued to the Plaintiff to file a case against the Defendant.\n12. For a judgment and decree against the Defendant to the effect that the Plaintiff and the\ntwo minor children born of the said marriage should be allowed to reside in the house\nbelonging to the Defendant at No: 436/1/W, Godellawatta Road, M"
  },
  {
    "case_id": "case6",
    "role": "OTHER",
    "snippet": "Page 1\nAnswer under Section 72 of the Civil Procedure Code\nIn the District Court of Moratuwa. Case Number: DDV 3613/24\nNature: Divorce\nProcedure: Regular\nValue: 5000/-\nHettiyakandage Rehan Anton Fernando,\n64/19, Uyana Road, Moratuwa. Plaintiff\n-Versus-\nFranciscu Hettige Vidya Sanali Silva,\nNo: 19, Housing Scheme, Lunawa, Moratuwa. Defendant\nOn this 17th day of February, 2024. The above-named Defendant, appearing through her Attorney-at-Law Mrs. Nadeeka N.\nSeneviratne, presents her answer and states and prays as follows:\n1. 2. 3. The Defendant states that she does not contest the first cause of action prayed for in the\nPlaintiff's plaint?®. 4. The Defendant requests equal rights regarding the child's maintenance, upbringing, legal\nand physical custody, and access, and agrees for the child t"
  },
  {
    "case_id": "case6",
    "role": "FACT",
    "snippet": "The Defendant states that she is aware of the case filed by the Plaintiff in the District\nCourt of Moratuwa and is aware of the facts in the plaint’. The proxy of the Plaintiff, the Plaint, and a copy thereof in the above-numbered case are\nsubmitted herewith, and | pray that it be ordered that they be accepted and filed in the case\nrecord, and, 4°\n| respectfully pray that, having informed the Honourable Court of the settlement reached\nwhereby the Defendant in this case will not be contesting the case, this case be ordered to be\ncalled in open court on the 19th day of February, 2024, to establish the facts for the purpose\nof concluding the legal proceedings without a contest."
  },
  {
    "case_id": "case6",
    "role": "ARGUMENT",
    "snippet": "The Defendant states that since she does not intend to live a married life with the\nPlaintiff, it is not necessary to participate in family counseling regarding this case, and\nthat a long time has passed since she separated from the Plaintiff’. The marriage certificate bearing No. 7773 and dated the 29th day of June, 2019, is\nmarked as P1 and submitted herewith to certify the said marriage, and it is prayed that it\nbe considered a part of the plaint itself\". The child's\nbirth certificate bearing No. 7141 and dated April 11, 2020, is marked as P2 and submitted\nherewith, and it is prayed that it be considered a part of the plaint itself”. Submissions on behalf of the Plaintiff:\nThe Plaintiff in this case filed this case in the lower court. 661 state that the Defendant in this case\nand | were"
  },
  {
    "case_id": "case6",
    "role": "DECISION",
    "snippet": "The Plaintiff states that after the marriage, they lived their married life in a rented house\nfor a period of about 4 months, but due to several economic problems, they both\ndecided to move to his parents’ house mentioned in the caption thereafter, and that\nalthough various problems arose between them from the beginning of the marriage, he\nlived peacefully with the Defendant, patiently enduring everything”. '°”\nFurther, it is hereby ordered and decreed that the legal and physical custody of the child born\nof this marriage, Hettiyakandage Ethan Anthony Fernando, is vested in both parties. '°°\nFurther, from the moment a Decree Absolute is entered herein, the Plaintiff and the\nDefendant... '°°\nPage 12\n..Shall be entitled to enjoy all the rights and privileges afforded to unmarried persons in "
  },
  {
    "case_id": "case7",
    "role": "OTHER",
    "snippet": "Page 1\nThis is a true copy of the Information Book of the.............. Police Station. Information Book\nDate: 2022/10/31\nTime: 0900\nPage: 424\nPara: 03 Regarding obtaining maintenance from the husband\nA complaint was made. [The following is a transcription of the legible parts of the handwritten complaint summary]\nMy name is Kaluthara Wedage... Shashikala... In 2019, at my husband's house, his mother and\nfather threw me out of the house. After that, | came to [my family's] house. | stayed there for a\nyear... my husband's mother and father swore at me in filth... My husband is Ariyapperuma\nRamanayakage Don Shashikamal... Since leaving my husband's house, he has only given me a\nsum of Rs. 20,000.00 to date. For this entire time, | have been spending on my children's\nexpenses. When | make a c"
  },
  {
    "case_id": "case7",
    "role": "ISSUE",
    "snippet": "Date of Issue: 2022/11/20\n| certify that the above extract is a true copy taken from the Information Book mentioned on\nthe first page, which is in my custody.\nSigned/-\nOfficer-In-Charge\nPage 3\nIn the District Court of Kaduwela."
  },
  {
    "case_id": "case7",
    "role": "ARGUMENT",
    "snippet": "To confirm the said marriage registration, a copy of the marriage certificate bearing No.\n5008 dated 2012.01.25 is marked as P1 and submitted herewith, and it is prayed that it be\naccepted as a part of the plaint. Page 4\nTo confirm this, the birth certificates of the two girls are marked as P2 and P3 respectively and\nare submitted herewith, and it is prayed that they be accepted as a part of the plaint. A true copy of the said complaint is marked as P4 and submitted herewith. The Defendant states that since he does not intend to live a married life with the Plaintiff,\nit is not necessary to participate in family counseling regarding this case, and that a long\ntime has passed since he separated from the Plaintiff."
  },
  {
    "case_id": "case7",
    "role": "FACT",
    "snippet": "The proxy of the defendant in the above-numbered case and the answer under Section 72 of\nthe Civil Procedure Code stating that the case is not contested are submitted herewith, and |\npray for an order that they be accepted and filed in the case record, and,\nHaving informed the Honourable Court of the settlement reached with the Plaintiff in this case\nwhereby the Defendant will not be contesting the case, | respectfully pray for an order that\nthis case be called in open court on the ..... day of ....., 2023, to establish the facts for the\npurpose of concluding the legal proceedings without a contest.\nSigned/-\nAttorney-at-Law for the Defendant\nPage 7\nAnswer under Section 72 of the Civil Procedure Code\nCase Number: DDV 4328/23\nNature: Divorce\nProcedure: Regular\nValue: Rs: 5000/-\nIn the Distri"
  }
]